Project/Toir/src/InformationRegisters/торо_СоответствияТеговАСУТПОбъектамТОИР/торо_СоответствияТеговАСУТПОбъектамТОИР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_СоответствияТеговАСУТПОбъектамТОИР</name>
  <resources>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </resources>
  <resources>
    <name>ТипСигнала</name>
    <type>
      <types>EnumRef.торо_ТипыСигналовАСУТП</types>
    </type>
  </resources>
  <resources>
    <name>Показатель</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </resources>
  <resources>
    <name>ПараметрНаработки</name>
    <type>
      <types>CatalogRef.ПараметрыВыработкиОС</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>CatalogRef.торо_ВидыЭксплуатации</types>
    </type>
  </resources>
  <resources>
    <name>Отключить</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаПростоя</name>
    <type>
      <types>CatalogRef.торо_ПричиныПростояОборудования</types>
    </type>
  </resources>
  <resources>
    <name>ВидДефекта</name>
    <type>
      <types>CatalogRef.торо_ТиповыеДефектыОборудования</types>
    </type>
  </resources>
  <resources>
    <name>ПоказательKPI</name>
    <type>
      <types>CatalogRef.торо_ПоказателиKPI</types>
    </type>
  </resources>
  <dimensions>
    <name>НаименованиеОР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Тег</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Подключение</name>
    <type>
      <types>CatalogRef.торо_ПодключенияКБазеДанных</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Enums/торо_ТипыСигналовАСУТП/торо_ТипыСигналовАСУТП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ТипыСигналовАСУТП</name>
  <enumValues>
    <name>Состояние</name>
  </enumValues>
  <enumValues>
    <name>Показатель</name>
  </enumValues>
  <enumValues>
    <name>Наработка</name>
  </enumValues>
  <enumValues>
    <name>Дефект</name>
  </enumValues>
  <enumValues>
    <name>KPI</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/InformationRegisters/торо_СоответствияТеговАСУТПОбъектамТОИР/RecordSetModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Для каждого Запись из ЭтотОбъект Цикл
		Если Запись.ТипСигнала = Перечисления.торо_ТипыСигналовАСУТП.Показатель Тогда
			ПроверяемыеРеквизиты.Добавить("Показатель");
			ПроверяемыеРеквизиты.Добавить("ВидДефекта");
		ИначеЕсли Запись.ТипСигнала = Перечисления.торо_ТипыСигналовАСУТП.Состояние Тогда
			ПроверяемыеРеквизиты.Добавить("Состояние");
			ПроверяемыеРеквизиты.Добавить("причинаПростоя");
		ИначеЕсли Запись.ТипСигнала = Перечисления.торо_ТипыСигналовАСУТП.Наработка Тогда
			ПроверяемыеРеквизиты.Добавить("ПараметрНаработки");
		ИначеЕсли Запись.ТипСигнала = Перечисления.торо_ТипыСигналовАСУТП.Дефект Тогда
			ПроверяемыеРеквизиты.Добавить("ВидДефекта");
		ИначеЕсли Запись.ТипСигнала = Перечисления.торо_ТипыСигналовАСУТП.KPI Тогда
			ПроверяемыеРеквизиты.Добавить("ПоказательKPI");
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
